{
  "name": "Add or update team membership",
  "enabledForApps": true,
  "githubCloudOnly": false,
  "method": "PUT",
  "path": "/teams/:team_id/memberships/:username",
  "previews": [],
  "params": [
    {
      "name": "team_id",
      "type": "integer",
      "required": true,
      "description": "",
      "location": "url"
    },
    {
      "name": "username",
      "type": "string",
      "required": true,
      "description": "",
      "location": "url"
    },
    {
      "name": "role",
      "type": "string",
      "description": "The role that this user should have in the team. Can be one of:  \n\\* `member` - a normal member of the team.  \n\\* `maintainer` - a team maintainer. Able to add/remove other team members, promote other team members to team maintainer, and edit the team's name and description.",
      "default": "member",
      "required": false,
      "enum": [
        "member",
        "maintainer"
      ],
      "location": "body"
    }
  ],
  "description": "Team synchronization is available for organizations using GitHub Enterprise Cloud. For more information, see [GitHub's products](https://help.github.com/articles/github-s-products) in the GitHub Help documentation.\n\nIf the user is already a member of the team's organization, this endpoint will add the user to the team. To add a membership between an organization member and a team, the authenticated user must be an organization owner or a maintainer of the team.\n\n**Note:** When you have team synchronization set up for a team with your organization's identity provider (IdP), you will see an error if you attempt to use the API for making changes to the team's membership. If you have access to manage group membership in your IdP, you can manage GitHub team membership through your identity provider, which automatically adds and removes team members in an organization. For more information, see \"[Synchronizing teams between your identity provider and GitHub](https://help.github.com/articles/synchronizing-teams-between-your-identity-provider-and-github/).\"\n\nIf the user is unaffiliated with the team's organization, this endpoint will send an invitation to the user via email. This newly-created membership will be in the \"pending\" state until the user accepts the invitation, at which point the membership will transition to the \"active\" state and the user will be added as a member of the team. To add a membership between an unaffiliated user and a team, the authenticated user must be an organization owner.\n\nIf the user is already a member of the team, this endpoint will update the role of the team member's role. To update the membership of a team member, the authenticated user must be an organization owner or a maintainer of the team.",
  "idName": "add-or-update-membership",
  "documentationUrl": "https://developer.github.com/v3/teams/members/#add-or-update-team-membership"
}
