{
  "name": "Create a deployment",
  "enabledForApps": true,
  "method": "POST",
  "path": "/repos/:owner/:repo/deployments",
  "previews": [
    {
      "name": "ant-man",
      "description": "**Note:** The `transient_environment` and `production_environment` parameters are currently available for developers to preview. During the preview period, the API may change without advance notice. Please see the [blog post](https://developer.github.com/changes/2016-04-06-deployment-and-deployment-status-enhancements) for full details.\n\nTo access the API during the preview period, you must provide a custom [media type](https://developer.github.com/enterprise/2.15/v3/media) in the `Accept` header:\n\n```\napplication/vnd.github.ant-man-preview+json\n\n```",
      "required": false
    }
  ],
  "params": [
    {
      "name": "owner",
      "type": "string",
      "required": true,
      "description": "",
      "location": "url"
    },
    {
      "name": "repo",
      "type": "string",
      "required": true,
      "description": "",
      "location": "url"
    },
    {
      "name": "ref",
      "type": "string",
      "description": "The ref to deploy. This can be a branch, tag, or SHA.",
      "required": true,
      "location": "body"
    },
    {
      "name": "task",
      "type": "string",
      "description": "Specifies a task to execute (e.g., `deploy` or `deploy:migrations`).",
      "default": "deploy",
      "required": false,
      "location": "body"
    },
    {
      "name": "auto_merge",
      "type": "boolean",
      "description": "Attempts to automatically merge the default branch into the requested ref, if it's behind the default branch.",
      "default": true,
      "required": false,
      "location": "body"
    },
    {
      "name": "required_contexts",
      "type": "string[]",
      "description": "The [status](https://developer.github.com/enterprise/2.15/v3/repos/statuses/) contexts to verify against commit status checks. If you omit this parameter, GitHub verifies all unique contexts before creating a deployment. To bypass checking entirely, pass an empty array. Defaults to all unique contexts.",
      "required": false,
      "location": "body"
    },
    {
      "name": "payload",
      "type": "string",
      "description": "JSON payload with extra information about the deployment.",
      "default": "\"\"",
      "required": false,
      "location": "body"
    },
    {
      "name": "environment",
      "type": "string",
      "description": "Name for the target deployment environment (e.g., `production`, `staging`, `qa`).",
      "default": "production",
      "required": false,
      "location": "body"
    },
    {
      "name": "description",
      "type": "string",
      "description": "Short description of the deployment.",
      "default": "\"\"",
      "required": false,
      "location": "body"
    },
    {
      "name": "transient_environment",
      "type": "boolean",
      "description": "Specifies if the given environment is specific to the deployment and will no longer exist at some point in the future.",
      "default": false,
      "required": false,
      "location": "body"
    },
    {
      "name": "production_environment",
      "type": "boolean",
      "description": "Specifies if the given environment is one that end-users directly interact with.",
      "default": "`true` when `environment` is `production` and `false` otherwise",
      "required": false,
      "location": "body"
    }
  ],
  "requests": [
    {
      "ref": "topic-branch",
      "payload": {
        "deploy": "migrate"
      },
      "description": "Deploy request from hubot"
    }
  ],
  "description": "Deployments offer a few configurable parameters with sane defaults.\n\nThe `ref` parameter can be any named branch, tag, or SHA. At GitHub we often deploy branches and verify them before we merge a pull request.\n\nThe `environment` parameter allows deployments to be issued to different runtime environments. Teams often have multiple environments for verifying their applications, such as `production`, `staging`, and `qa`. This parameter makes it easier to track which environments have requested deployments. The default environment is `production`.\n\nThe `auto_merge` parameter is used to ensure that the requested ref is not behind the repository's default branch. If the ref _is_ behind the default branch for the repository, we will attempt to merge it for you. If the merge succeeds, the API will return a successful merge commit. If merge conflicts prevent the merge from succeeding, the API will return a failure response.\n\nBy default, [commit statuses](https://developer.github.com/enterprise/2.15/v3/repos/statuses) for every submitted context must be in a `success` state. The `required_contexts` parameter allows you to specify a subset of contexts that must be `success`, or to specify contexts that have not yet been submitted. You are not required to use commit statuses to deploy. If you do not require any contexts or create any commit statuses, the deployment will always succeed.\n\nThe `payload` parameter is available for any extra information that a deployment system might need. It is a JSON text field that will be passed on when a deployment event is dispatched.\n\nThe `task` parameter is used by the deployment system to allow different execution paths. In the web world this might be `deploy:migrations` to run schema changes on the system. In the compiled world this could be a flag to compile an application with debugging enabled.\n\nUsers with `repo` or `repo_deployment` scopes can create a deployment for a given ref:\n\nA simple example putting the user and room into the payload to notify back to chat networks.\n\nA more advanced example specifying required commit statuses and bypassing auto-merging.\n\nYou will see this response when GitHub automatically merges the base branch into the topic branch instead of creating a deployment. This auto-merge happens when:\n\n*   Auto-merge option is enabled in the repository\n*   Topic branch does not include the latest changes on the base branch, which is `master`in the response example\n*   There are no merge conflicts\n\nIf there are no new commits in the base branch, a new request to create a deployment should give a successful response.\n\nThis error happens when the `auto_merge` option is enabled and when the default branch (in this case `master`), can't be merged into the branch that's being deployed (in this case `topic-branch`), due to merge conflicts.\n\nThis error happens when the `required_contexts` parameter indicates that one or more contexts need to have a `success` status for the commit to be deployed, but one or more of the required contexts do not have a state of `success`.",
  "idName": "create-deployment",
  "documentationUrl": "https://developer.github.com/enterprise/2.15/v3/repos/deployments/#create-a-deployment"
}
